{
  "backend/main.mo": "Minimal Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report mapping requested layout and navigation changes to affected frontend files.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries of all frontend components and data files.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes using custom OKLCH color tokens.",
  "frontend/index.html": "Base HTML template mounting the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React component composing header, sections, and footer, ending after Skills.",
  "frontend/src/components/portfolio/GalleryGrid.tsx": "Grid component rendering gallery thumbnails with hover effects and click-to-open behavior.",
  "frontend/src/components/portfolio/GalleryLightbox.tsx": "Modal lightbox showing full-size gallery images with title and caption.",
  "frontend/src/components/portfolio/SectionHeader.tsx": "Reusable section header with optional eyebrow and subtitle and configurable alignment.",
  "frontend/src/components/portfolio/sections/AboutSection.tsx": "About section presenting four content-creator highlights in a card grid.",
  "frontend/src/components/portfolio/sections/ContactSection.tsx": "Renders the contact section with email, phone, location, resume download, and social links using data from contactInfo.",
  "frontend/src/components/portfolio/sections/ExperienceSection.tsx": "Displays a list of experience cards showing job titles, organizations, periods, descriptions, and highlights.",
  "frontend/src/components/portfolio/sections/GallerySection.tsx": "Shows a gallery grid and lightbox for portfolio items with selectable images.",
  "frontend/src/components/portfolio/sections/HeroSection.tsx": "Provides the landing hero section with intro text, background image, and buttons that smooth-scroll to skills and experience.",
  "frontend/src/components/portfolio/sections/ServicesSection.tsx": "Lists service offerings as cards with icons, titles, and descriptions based on services data.",
  "frontend/src/components/portfolio/sections/SkillsSection.tsx": "Displays skill categories with labeled badges sourced from skillCategories.",
  "frontend/src/components/portfolio/SiteFooter.tsx": "Footer with portfolio summary, quick links, and caffeine.ai attribution.",
  "frontend/src/components/portfolio/SiteHeader.tsx": "Sticky responsive header with smooth-scroll navigation and mobile sheet menu.",
  "frontend/src/data/portfolio.ts": "Defines interfaces and provides static portfolio data for services, experiences, skills, gallery items, and contact info.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, clear, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file noting that no backend queries exist and data is client-managed.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive OKLCH CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors from CSS variables, container settings, fonts, animations, and plugins.",
  "project_state.json": "Stores project metadata, existing features, and a pending request to remove sections after Skills & Expertise."
}